# 1. Create the DataFrame

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
data={
    'Roll_NO':[101,102,103,104,105],
    'Name':['Riya','Arjun','Sneha','Rakesh','Aditi'],
    'Age':[17,18,17,19,18],
    'Marks_Math':[88,75,90,65,95],
    'Marks_Eng':[92,85,78,70,88],
    'Gender':['f','m','f','m','f']
}
df=pd.DataFrame(data)
df

   Roll_NO    Name  Age  Marks_Math  Marks_Eng Gender
0      101    Riya   17          88         92      f
1      102   Arjun   18          75         85      m
2      103   Sneha   17          90         78      f
3      104  Rakesh   19          65         70      m
4      105   Aditi   18          95         88      f

# 2. Display only the names and English marks of all students.

In [8]:
df['Name'],df['Marks_Eng']

(0      Riya
 1     Arjun
 2     Sneha
 3    Rakesh
 4     Aditi
 Name: Name, dtype: object,
 0    92
 1    85
 2    78
 3    70
 4    88
 Name: Marks_Eng, dtype: int64)

In [9]:
df[['Name','Marks_Eng']]

     Name  Marks_Eng
0    Riya         92
1   Arjun         85
2   Sneha         78
3  Rakesh         70
4   Aditi         88

# 3. Add a new column “Total_Marks” as the sum of Marks_Math and Marks_Eng.

In [11]:
df['Total_Marks']=df[['Marks_Math','Marks_Eng']].sum(axis=1)
df

   Roll_NO    Name  Age  Marks_Math  Marks_Eng Gender  Total_Marks
0      101    Riya   17          88         92      f          180
1      102   Arjun   18          75         85      m          160
2      103   Sneha   17          90         78      f          168
3      104  Rakesh   19          65         70      m          135
4      105   Aditi   18          95         88      f          183

# 4.Find the average marks in Math using a Pandas function.

In [44]:
df['Marks_Math'].mean()

82.6

# 5.Display the records of all female students.

In [45]:
df[df["Gender"] == 'f']

   Roll_NO   Name  Age  Marks_Math  Marks_Eng Gender  Total_Marks
0      101   Riya   17          88         92      f          180
2      103  Sneha   17          90         78      f          168
4      105  Aditi   18          95         88      f          183

# 6. Sort the DataFrame by Marks_Eng in descending order.

In [46]:
df.sort_values(by = 'Marks_Eng',ascending = False)

   Roll_NO    Name  Age  Marks_Math  Marks_Eng Gender  Total_Marks
0      101    Riya   17          88         92      f          180
4      105   Aditi   18          95         88      f          183
1      102   Arjun   18          75         85      m          160
2      103   Sneha   17          90         78      f          168
3      104  Rakesh   19          65         70      m          135

# 7. Replace gender values: “F” → “Female”, “M” → “Male” using .map().

In [47]:
df['Gender']=df['Gender'].str.upper().map({'F':'Female','M':'Male'})
df

   Roll_NO    Name  Age  Marks_Math  Marks_Eng  Gender  Total_Marks
0      101    Riya   17          88         92  Female          180
1      102   Arjun   18          75         85    Male          160
2      103   Sneha   17          90         78  Female          168
3      104  Rakesh   19          65         70    Male          135
4      105   Aditi   18          95         88  Female          183

# Add a new column Result with value “Pass” if Total_Marks >= 150, else “Fail” (using apply() with lambda).

In [48]:
df['Result']= df['Total_Marks'].apply(lambda x:'pass' if x>=150 else 'fail' )
df

   Roll_NO    Name  Age  Marks_Math  Marks_Eng  Gender  Total_Marks Result
0      101    Riya   17          88         92  Female          180   pass
1      102   Arjun   18          75         85    Male          160   pass
2      103   Sneha   17          90         78  Female          168   pass
3      104  Rakesh   19          65         70    Male          135   fail
4      105   Aditi   18          95         88  Female          183   pass

# 9. Use map() to convert all names to uppercase from the Name column.

In [49]:
df['Name']=df['Name'].map(lambda x: x.upper())
df

   Roll_NO    Name  Age  Marks_Math  Marks_Eng  Gender  Total_Marks Result
0      101    RIYA   17          88         92  Female          180   pass
1      102   ARJUN   18          75         85    Male          160   pass
2      103   SNEHA   17          90         78  Female          168   pass
3      104  RAKESH   19          65         70    Male          135   fail
4      105   ADITI   18          95         88  Female          183   pass

# 10. Use filter() to get the list of students whose Marks_Math is greater than 80.

In [50]:
def greater(a):
    if a>80:
        return True
l1=df["Marks_Math"]
res=list(filter(greater,l1))
res

[88, 90, 95]

# 11. Use lambda to create a new column Grade:
	•	A if Total_Marks ≥ 170
	•	B if Total_Marks ≥ 150
	•	C otherwise

In [51]:
df['Grade']=df['Total_Marks'].apply(lambda x: "A" if x>170 else 'B' if x>150 else 'C')
df

,Roll_NO,Name,Age,Marks_Math,Marks_Eng,Gender,Total_Marks,Result,Grade
0,101,RIYA,17,88,92,Female,180,pass,A
1,102,ARJUN,18,75,85,Male,160,pass,B
2,103,SNEHA,17,90,78,Female,168,pass,B
3,104,RAKESH,19,65,70,Male,135,fail,C
4,105,ADITI,18,95,88,Female,183,pass,A

# 12. Use reduce() to calculate the total of all Math marks.
# (Hint: You need to from functools import reduce and apply it to students['Marks_Math'])

In [52]:
from functools import reduce
tm=reduce(lambda x,y : x+y  , df['Marks_Math'])
tm

413

# Challenge Questions
# 13.Count how many students are below the age of 18.

In [53]:
(df['Age']<18).sum()

2

# 14.Create a new column Average which gives average of both subjects.

In [54]:
df['Average']=df[['Marks_Math','Marks_Eng']].mean(axis=1)
df

,Roll_NO,Name,Age,Marks_Math,Marks_Eng,Gender,Total_Marks,Result,Grade,Average
0,101,RIYA,17,88,92,Female,180,pass,A,90.0
1,102,ARJUN,18,75,85,Male,160,pass,B,80.0
2,103,SNEHA,17,90,78,Female,168,pass,B,84.0
3,104,RAKESH,19,65,70,Male,135,fail,C,67.5
4,105,ADITI,18,95,88,Female,183,pass,A,91.5

# 15.Display names of students who scored more in English than Math.

In [55]:
df[df['Marks_Eng']>df['Marks_Math']]['Name']

0      RIYA
1     ARJUN
3    RAKESH
Name: Name, dtype: object

# 16.Group students by Gender and calculate average marks for each gender.

In [56]:
df.groupby('Gender')[['Marks_Math','Marks_Eng','Total_Marks']].mean()

        Marks_Math  Marks_Eng  Total_Marks
Gender
Female        91.0       86.0        177.0
Male          70.0       77.5        147.5

# 17.Find the student with the highest total marks using Pandas.

In [57]:
df.loc[df['Total_Marks'].idxmax()]

Roll_NO           105
Name            ADITI
Age                18
Marks_Math         95
Marks_Eng          88
Gender         Female
Total_Marks       183
Result           pass
Grade               A
Average          91.5
Name: 4, dtype: object